constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType LES;

LES{
LESModel        Smagorinsky;
delta           cubeRootVol;
turbulence on;
printCoeffs     true;

SmagorinskyCoeffs
{
    // Cs          0.165;  
    Ck          0.094;  
    Ce          1.048;  
}
}